app/controllers/top_controller.rb

SELECT `products`.* FROM `products` ORDER BY id DESC LIMIT 20
---
  def index
    @products = Product.order('id ASC').limit(20)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
 def entry
  @product = Product.find(params[:id])

INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2015-11-04 07:30:59', '', 0, 1, 'すばらしい作品でした。感動ものです。', '2015-11-04 07:30:59')
---
def post
  Review.create(create_params)